app/controllers/application_controller.rb

  def set_page
    if current_user
      @requests_notification = (current_user.requests.where(state: %w[Accepted
                                                                      Rejected]) + current_user.recieved_requests.where(state: 'Pending')).sort_by(&:updated_at).reverse
---
SELECT "requests".* FROM "requests" INNER JOIN "turnos" ON "requests"."turno_id" = "turnos"."id" WHERE "turnos"."user_id" = $1 AND "requests"."state" = $2  [["user_id", 3], ["state", "Pending"]]