app/controllers/turnos_controller.rb

  def index
    @all_turnos = Turno.all
    @filtered_turnos = Turno.all
    if params[:arrival_address] && (params[:arrival_address] != '')
      @filtered_turnos = @filtered_turnos.where('lower(arrival_address) like ?',
                                                "%#{params[:arrival_address].downcase}%")
    end
    if params[:departure_address] && (params[:departure_address] != '')
      @filtered_turnos = @filtered_turnos.where('lower(departure_address) like ?',
                                                "%#{params[:departure_address].downcase}%")
    end
    @filtered_turnos = @filtered_turnos.select { |t| t.datetime.to_date.to_s == params[:date].to_s } if params[:date] && (params[:date] != '')
    @filtered_turnos = @filtered_turnos.select { |t| t.datetime.strftime('%H:%M') == params[:time] } if params[:time] && (params[:time] != '')
    if params[:time] || params[:date]
      status = []
      status << params[:scheduled] if params[:scheduled]
      status << params[:travelling] if params[:travelling]
      status << params[:finished] if params[:finished]
    else
      status = %w[Scheduled Travelling Finished]
    end
    @filtered_turnos = @filtered_turnos.select { |t| status.include? t.status }
---
SELECT "turnos".* FROM "turnos"