app/models/user.rb

  def participating_turnos(as_driver = true)
    if as_driver
      Turno.all.select { |t| t.passengers.include?(self) || t.driver == self }
    else
      Turno.all.select { |t| t.passengers.include?(self) }
---
SELECT "turnos".* FROM "turnos"